#include <iostream>
#include <string>
using namespace std;

#define HEIGHT 5

int main()
{
	int num, num2, digit, length = 0;
	
	// Заполняем массив с изображениями цифр
	string font[][HEIGHT] = 
	{
		{
			"  000  ",
			" 0   0 ",
			" 0   0 ",
			" 0   0 ",
			"  000  "
		},
		{
			"    11 ",
			" 11 11 ",
			"    11 ",
			"    11 ",
			"    11 "
		},
		{
			"  222  ",
			" 2   2 ",
			"    2  ",
			"  22   ",
			" 22222 "
		},
		{
			" 3333  ",
			"     3 ",
			"  333  ",
			"     3 ",
			" 3333  "
		},
		{
			" 4   4 ",
			" 4   4 ",
			" 44444 ",
			"     4 ",
			"     4 "
		},
		{
			" 55555 ",
			" 5     ",
			" 5555  ",
			"     5 ",
			" 5555  "
		},
		{
			"  666  ",
			" 6     ",
			" 6666  ",
			" 6   6 ",
			"  666  "
		},
		{
			" 77777 ",
			"    7  ",
			"   7   ",
			"  7    ",
			" 7     "
		},
		{
			"  888  ",
			" 8   8 ",
			"  888  ",
			" 8   8 ",
			"  888  "
		},
		{
			"  999  ",
			" 9   9 ",
			"  9999 ",
			"     9 ",
			"  999  "
		}
	};
	
	// Получаем число
	cin >> num;
	num2 = num; // Копия исходного числа, чтобы не потерять его во время определения длины
	
	// Определяем кол-во цифр в числе
	while (num2 > 0)
	{
		num2 /= 10;
		length++;
	}
	
	// Разбиваем число на цифры и складываем их в массив digits
	int digits[length];
	for (int i = 0; i < length; i++)
	{
		digits[length - (i + 1)] = num % 10; // "length - (i + 1)" - сразу распологаем цифры в правильном порядке
		num /= 10;
	}
	
	// Выводим число
	for (int i = 0; i < HEIGHT; i++) // для каждой строки
	{
		for (int k = 0; k < length; k++) // Для каждой цифры из исходного числа
		{
			cout << font[digits[k] /* <-- забираем цифру из digits */ ][i] << "  ";
		}
		cout << endl;
	}
	cout << endl;
}
