#include <stdio.h>  
#include <iostream>
using namespace std;
  
int main() 
{  
	cout << "°°°1°° ±±2±±± µµ3µµµ ¶¶¶4¶¶¶ ··5··· »»6»» éé7ééé öö8ööö óó9óóó êê10êêê åå11ååå åå12ååå íí13ííí ãã14ããã" << 
	"øø15øøø ù16ùùùù çç17ççç õõ18õõõ úúúú19ú ôôô20ôô û21ûûûû ââ22âââ ààà23àà ïï24ïïï ððð25ðð î26îîîî ëë27ëëë äää28ää æææ29ææ ý30ýýýý " <<
	"ÿÿÿ56ÿÿ ÷÷÷57÷÷ ñññ58ññ ììì59ìì èèè60èè òòò61òò ü62üüüü ááá63áá þþþ64þþ ÉÉÉ65ÉÉ ÖÖÖ66ÖÖ ÓÓ67ÓÓÓ ÊÊÊ68ÊÊ ÅÅÅ69ÅÅ ÍÍ70ÍÍÍ Ã71ÃÃÃÃ  " <<
	"ØØ31ØØØ Ù32ÙÙÙÙ ÇÇÇ33ÇÇ ÕÕ34ÕÕÕ ÚÚ35ÚÚÚ ÔÔ36ÔÔÔ ÛÛ37ÛÛÛ Â38ÂÂÂÂ ÀÀÀ39ÀÀ ÏÏÏ40ÏÏ Ð41ÐÐÐÐ Î42ÎÎÎÎ Ë43ËËËË Ä44ÄÄÄÄ ÆÆÆ45ÆÆ ÝÝÝ46ÝÝ " <<
	"ßßßß47ß ×××48×× ÑÑ49ÑÑÑ ÌÌÌ50ÌÌ ÈÈÈÈ51È ÒÒ52ÒÒÒ ÜÜÜ53ÜÜ Á54ÁÁÁÁ ÞÞÞ55ÞÞ ..... ,,,,, ///// \\\\\ !!!!! ¹¹¹¹¹ ;;;;; %%%%% :::::" <<
	"????? ***** ((((( ))))) @@@@@ ##### $$$$$ ^^^^^ &&&&& *****" << endl << endl 
	<< "à á â ã ä å  æ ç è ê ë ì í î ï ð ñ ò ó ô õ ö ÷ ø ù ú û ü ý þ ÿ À Á Â Ã Ä Å ¨ Æ Ç È É Ê Ë Ì Í Î Ï Ð Ñ Ò Ó Ô Õ Ö × Ø Ù Ú Û Ü Ý Þ ß ¹"<< endl;
	system ("pause");
}  

